app/controllers/accounts_controller.rb

  def index
    @accounts = Account.all
---
SELECT `accounts`.* FROM `accounts`

  def create
    @account = Account.new(account_params)

    respond_to do |format|
      if @account.save
---
INSERT INTO `accounts` (`slug`, `name`, `description`, `created_at`, `updated_at`) VALUES ('papa-clinic', 'Jonathan Papa', 'New Dental Clinic', '2021-02-17 08:01:19.609609', '2021-02-17 08:01:19.609609')

    def set_account
      @account = Account.find(params[:id])
---
SELECT `accounts`.* FROM `accounts` WHERE `accounts`.`id` = 1 LIMIT 1