app/controllers/schedules_controller.rb

SELECT `schedules`.* FROM `schedules` WHERE `schedules`.`account_id` = '1'
---
  def index
    @schedules = Schedule.where(account_id: @account.id)

INSERT INTO `schedules` (`account_id`, `name`, `gender`, `phone`, `birthday`, `address`, `email`, `created_at`, `updated_at`) VALUES ('1', 'Benida Mercado', 'Female', '12340987', '12-12-12', 'San Juan', 'benida@me.com', '2021-02-17 09:20:23.799200', '2021-02-17 09:20:23.799200')
---
  def create
    @schedule = Schedule.new(schedule_params)

    respond_to do |format|
      if @schedule.save

SELECT `schedules`.* FROM `schedules` WHERE `schedules`.`id` = 1 LIMIT 1
---
    def set_schedule
      @schedule = Schedule.find_by!(id: params[:id], account_id: @account.id)

SELECT `accounts`.* FROM `accounts` WHERE `accounts`.`slug` = 'papa-clinic' LIMIT 1
---
    def set_account
      @account = Account.find_by!(slug: request.subdomain)